from backend import app
import pytest
import requests
url = "http://127.0.0.1:5000/"
case_data = {
        
        "מס משימה": "6060",
        "מס ניידת": "4171",
        "תאריך": "22/12/2024",
        "פרטי המטופל": {
            "סוג תעודה": "תעודת זהות",
            "גיל": 43,
            "שם האב": "דוד",
            #"מייל": "example@example.com",
            "מין": "נקבה",
            "ת. לידה": "22/12/2024",
            "קופת חולים": "מאוחדת",
            "כתובת": "ירושלים",
            "שם מלא": "שם דמיוני",
            "טלפון": "050-3724274",
            "ישוב": "אשדוד"
        },
        "פרטי האירוע": {
            "כתובת": "ירושלים צפון",
            "מקום האירוע": "בבית",
            "עיר": "באר שבע"
        },
        "פירוט המקרה": {
            "המקרה שנמצא": "דום לב",
            "תלונה עיקרית": "חשד ל-דום לב",
            "אנמנזה": "אנמנזה וסיפור מקרה של חשד ל-דום לב. המטופל חש ברע והוזמן צוות לטיפול.",
            "סטטוס המטופל": "לא יציב",
            "רקע רפואי": "סוכרת",
            "רגישויות": "אבקנים",
            "תרופות קבועות": "אספירין",
            "קוד אירוע": "10"
        },
        "מדדים": [
            {
                "זמן בדיקה": "12:29",
                "הכרה": "בהכרה",
                "נשימה": "סדירה",
                "קצב נשימה": "20 בדקה",
                "דופק": "נמוש",
                "דופק לדקה": "61",
                "מצב העור": "סמוק",
                "סרגל כאב": "4",
                "האזנה": "תקינה",
                "ריאה ימין": "כא טובה",
                "ריאה שמאל": "כא טובה",
                "ETCO2": "34",
                "קצב לב": "לא סדיר",
                "אישונים": "שווים",
                "ציון גלזגו": "15"
            }
        ],
        "טיפולים": [
            {
                "זמן": "16:12",
                "טיפול שניתן": [
                    "דפיברילטור",
                    "החייאה"
                ]
            }
        ],
        "טיפול תרופתי": [
            {
                "זמן": "14:48",
                "תרופה": [
                    "גלוקוז"
                ]
            }
        ],
        "פינוי": {
            "אופן הפינוי": "רכב פרטי",
            "יעד הפינוי": "בית חולים",
            "שם בית החולים": "הדסה",
            "מחלקה": "מיון",
            "שם המקבל ביעד הפינוי": "ד\"ר דוד"
        }
    }
def testInsert():
    response = requests.post(url+"insert_case", json=case_data)
    print(response.status_code)
    print(response.json())
def testSearch():
    response = requests.post(url+"search_similar", json=case_data)
    print(response.status_code)
    print(response.json())

    
testSearch()
